{
    "MSG_001": "Mục này bắt buộc phải nhập.",
    "MSG_002": "Loại tiền tệ không tồn tại",
    "MSG_003": "Tiền tệ gốc trùng với tiền tệ chuyển đổi",
    "MSG_004": "Cập nhật thông tin thành công",
    "MSG_005": "Thời gian áp dụng tỷ giá tiền tệ bị trùng",
    "MSG_006": "Số lượng cất phải bằng số lượng thực nhập",
    "MSG_007": "Tạo yêu cầu thành công",
    "MSG_008": "Thời gian xuất báo cáo không được vượt quá ngày hiện tại",
    "MSG_011": "Mã khởi tạo đã tồn tại trong hệ thống",
    "MSG_012": "Thông báo tạo mới thành công",
    "MSG_013": "Không có dữ liệu phù hợp",
    "MSG_014": "File import không hợp lệ",
    "MSG_015": "Thiết lập tồn kho thành công",
    "MSG_016": "Số lượng lưu kho tối thiểu phải nhỏ hơn hoặc bằng số lượng lưu kho an toàn",
    "MSG_017": "Số lượng lưu kho an toàn phải nhỏ hơn hoặc bằng số lượng lưu kho tối đa",
    "MSG_018": "Số lượng lưu kho tối thiểu phải nhỏ hơn số lượng lưu kho tối đa",
    "MSG_019": "Cập nhật thiết lập tồn kho thành công",
    "MSG_020": "Xóa thiết lập tồn kho thành công",
    "MSG_021": "Bạn chắc chắn muốn xóa thiết lập tồn kho?",
    "MSG_022": "Thiết lập thời hạn lưu kho thành công",
    "MSG_023": "Bạn có muốn chuyển trạng thái <<đối tượng>>sang Active/Inactive không?",
    "MSG_024": "Cập nhật thời hạn lưu kho thành công",
    "MSG_025": "Bạn chắc chắn muốn xóa thiết lập thời hạn lưu kho?",
    "MSG_026": "Xóa thiết lập giới hạn tồn kho thành công",
    "MSG_027": "Thời hạn lưu kho phải lớn hơn Thời hạn cảnh báo lưu kho",
    "MSG_028": "Mật khẩu hiện tại không đúng.",
    "MSG_029": "Họ tên không được quá 50 ký tự",
    "MSG_030": "Số điện thoại không đúng định dạng.",
    "MSG_031": "Ngày sinh không hợp lệ",
    "MSG_032": "Cập nhật trạng thái thành công",
    "MSG_033": "Tạo người dùng thành công",
    "MSG_034": "Cập nhật thông tin người dùng thành công",
    "MSG_035": "Xóa thông tin người dùng thành công",
    "MSG_036": "Bạn chắc chắn muốn xóa người dùng?",
    "MSG_037": "Bạn chắc chắc muốn cập nhật trạng thái người dùng?",
    "MSG_038": "Cập nhật trạng thái người dùng thành công",
    "MSG_039": "Mã đơn vị tính phải chứa tối thiểu 6 ký tự và tối đa 8 ký tự",
    "MSG_040": "Tên đơn vị tính phải chứa tối thiểu 20 ký tự và tối đa 255 ký tự",
    "MSG_041": "Tên viết tắt phải chứa tối đa 8 ký tự",
    "MSG_042": "Dữ liệu vượt quá độ dài ký tự quy định",
    "MSG_043": "Kiểu dữ liệu Nguồn dữ liệu bảng sản phẩm chỉ được phép chọn 1 lần",
    "MSG_044": "Mã danh mục đối tượng phải chứa 3 ký tự",
    "MSG_045": "Tên danh mục đối tượng phải chứa tối thiểu 20 ký tự và tối đa 255 ký tự",
    "MSG_046": "Mã vật tư phải chứa 16 ký tự",
    "MSG_047": "Tên vật tư phải chứa tối thiểu 20 ký tự và tối đa 255 ký tự",
    "MSG_048": "Trường nguồn dữ liệu không đúng quy tắc",
    "MSG_049": "Vui lòng chọn Mã danh mục đối tượng",
    "MSG_050": "Thông tin cấu hình được tạo thành công",
    "MSG_051": "Thông tin cấu hình được cập nhật thành công",
    "MSG_052": "{{Têm item}} phải là ký tự số.",
    "MSG_053": "{{Têm item}} vượt quá số ký tự tối đa.",
    "MSG_054": "Mã của Đơn vị tính đã tồn tại trong hệ thống",
    "MSG_055": "Tạo mới dữ liệu thành công",
    "MSG_056": "{{Đối tượng}} được tạo thành công.",
    "MSG_057": "{itemValue} đã tồn tại.",
    "MSG_058": "{{Tên item}} không đúng định dạng.",
    "MSG_059": "{{Đối tượng}} được cập nhật thành công",
    "MSG_060": "Mã tổ máy phải chứa tối thiểu 3 ký tự và tối đa 5 ký tự",
    "MSG_061": "Mã kệ phải chứa tối thiểu 3 ký tự và tối đa 5 ký tự",
    "MSG_062": "Mã ngăn phải chứa tối thiểu 3 ký tự và tối đa 5 ký tự",
    "MSG_063": "Mã hộc phải chứa tối thiểu 3 ký tự và tối đa 5 ký tự",
    "MSG_064": "Không thể thực hiện Inactive. Vị trí này đang chứa các vật tư.",
    "MSG_065": "Vị trí này đang chứa các phần tử con đang hoạt động. Bạn có muốn inactive các phần tử con này không?",
    "MSG_066": "Tạo phiếu nhập thành công",
    "MSG_067": "Số lượng dự kiến nhập phải nhỏ hơn hoặc bằng số lượng yêu cầu và lớn hơn 0",
    "MSG_068": "Vui lòng chọn ít nhất 1 vật tư",
    "MSG_069": "Vật tư đã được nhập đủ số lượng",
    "MSG_070": "Cập nhật thông tin vật tư thành công",
    "MSG_071": "Vật tư đã được gửi yêu cầu cấp mã ",
    "MSG_072": "Mã vật tư đã tồn tại",
    "MSG_073": "Yêu cầu cấp mã vật tư thất bại, vui lòng thử lại sau.",
    "MSG_074": "Yêu cầu cấp mã đã được tiếp nhận. ",
    "MSG_075": "Trường dữ liệu yêu cầu tạo mới đã có trong hệ thống",
    "MSG_076": "Gửi yêu cầu hủy không thành công",
    "MSG_077": "Yêu cầu hủy được gửi thành công",
    "MSG_078": "Số lô phải có dạng [Mã kho]_Lot[Số tự tăng]",
    "MSG_079": "Nhập kho thành công",
    "MSG_080": "Phiếu nhập kho có chứa vật tư chưa được cấp mã 16 số, vui lòng kiểm tra lại",
    "MSG_081": "Nhận hàng thành công",
    "MSG_082": "Từ ngày phải nhỏ hơn hoặc bằng Đến ngày",
    "MSG_083": "Vị trí không còn chỗ trống, vui lòng chọn vị trí khác",
    "MSG_084": "SL không được lớn hơn số vị trí trống",
    "MSG_085": "Cất hàng thành công",
    "MSG_086": "SL cất phải nhỏ hơn số lượng còn lại phải cất",
    "MSG_087": "Bạn có chắc chắn muốn đóng yêu cầu không?",
    "MSG_088": "Đóng yêu cầu thành công",
    "MSG_089": "Tạo giấy đề nghị xuất kho vật tư thành công",
    "MSG_090": "Sửa giấy đề nghị xuất kho vật tư thành công",
    "MSG_091": "Bạn chắc chắn muốn xóa giấy đề nghị xuất kho vật tư?",
    "MSG_092": "Xóa bản ghi thành công",
    "MSG_093": "Bạn có chắc chắn muốn xác nhận không?",
    "MSG_094": "Xác nhận thành công",
    "MSG_095": "Bạn có chắc chắn muốn từ chối không?",
    "MSG_096": "Từ chối thành công",
    "MSG_097": "Xác nhận nhập kho đồng nghĩa với việc bạn sẽ đồng bộ dữ liệu này sang hệ thống EBS. Bạn chắc chắn muốn xác nhận?",
    "MSG_098": "Số lượng kế hoạch xuất vượt quá số lượng khả dụng",
    "MSG_099": "Tồn tại bản ghi chưa đủ điều kiện đồng bộ",
    "MSG_100": "Số lượng dự kiến xuất vượt quá số lượng yêu cầu",
    "MSG_101": "Cập nhật số lượng thành công",
    "MSG_102": "Số lượng cần mua vượt quá số lượng yêu cầu",
    "MSG_103": "Tạo phiếu xuất kho thành công",
    "MSG_104": "Cập nhật phiếu xuất kho thành công",
    "MSG_105": "Bạn chắc chắn muốn xóa bản ghi này không?",
    "MSG_106": "Số lượng dự kiến xuất vượt quá số lượng yêu cầu",
    "MSG_107": "Số lượng xuất dự kiến vượt quá số lượng được cấp phép",
    "MSG_108": "Lấy hàng thành công",
    "MSG_109": "Số lượng lấy vượt quá số lượng tồn kho tại vị trí",
    "MSG_110": "Số lượng lấy vượt quá số lượng kế hoạch còn lại",
    "MSG_111": "Chỉ được chọn tối đa 10 vật tư trên một phiếu xuất kho.",
    "MSG_112": "Số lượng thực tế chưa được nhập",
    "MSG_113": "Số lượng xuất thực tế đang ít hơn so với số lượng dự kiến, bạn có chắc chắn muốn xuất không?",
    "MSG_114": "Xuất kho thành công",
    "MSG_115": "Dữ liệu không hợp lệ. Mã QR được chọn chưa nhập số lượng in",
    "MSG_116": "Không tìm thấy dữ liệu",
    "MSG_117": "Đảo hàng thành công.",
    "MSG_118": "Vị trí đi và vị trí đến trùng nhau",
    "MSG_119": "Số lượng chuyển vượt quá số lượng tồn",
    "MSG_120": "Vị trí đến không thể chứa hết số vật tư chuyển đến ",
    "MSG_121": "Không tìm thấy mã vị trí",
    "MSG_122": "Mã vị trí không thuộc kho đã chọn.",
    "MSG_123": "Không tìm thấy mã vật tư",
    "MSG_124": "Vật tư không thuộc vị trí đi.",
    "MSG_125": "Chưa chọn vị trí đi.",
    "MSG_126": "Chưa chọn vị trí đến.",
    "MSG_127": "Vật tư không có tồn trong kho đã chọn.",
    "MSG_128": "Tạo lệnh kiểm kê thành công",
    "MSG_129": "Đang tồn tại một lệnh kiểm kê có hiệu lực khác, không thể tạo mới",
    "MSG_130": "Sửa lệnh kiểm kê thành công",
    "MSG_131": "Bạn có chắc chắn muốn đóng lệnh kiểm kê không?",
    "MSG_132": "Ngày chốt kỳ không vượt quá ngày hiện tại và không quá 3 tháng trước.",
    "MSG_133": "Kho nhập phải là kho dài hạn",
    "MSG_134": "Số lượng chuyển phải nhỏ hơn hoặc bằng số lượng vật tư quá hạn lưu kho",
    "MSG_135": "Tạo lệnh chuyển kho thành công",
    "MSG_136": "Số lượng xuất phải nhỏ hơn hoặc bằng số lượng tồn kho có thể xuất",
    "MSG_137": "Số lượng xuất phải bằng số lượng yêu cầu chuyển",
    "MSG_138": "Số lượng nhập phải bằng số lượng yêu cầu chuyển",
    "MSG_139": "Số lượng thực nhập phải bằng số lượng nhập dự kiến",
    "MSG_140": "Chưa đủ số lượng vật tư cần nhập kho",
    "MSG_141": "Số lượng xuất vượt quá số lượng xuất dự kiến",
    "MSG_142": "Bạn có chắc chắn muốn gửi lại dữ liệu đồng bộ không?",
    "MSG_143": "Gửi lại thành công",
    "MSG_144": "Bạn có chắc chắn muốn hủy đồng bộ không?",
    "MSG_145": "Hủy đồng bộ thành công",
    "MSG_146": "Gửi lại thất bại",
    "MSG_147": "Tạo phiếu điều chỉnh thành công",
    "MSG_148": "File không đúng định dạng",
    "MSG_149": "Dung lượng file tối đa là 4MB",
    "MSG_150": "Loại chi phí phải trùng segment 4 của tài khoản kế toán",
    "MSG_151": "Xác nhận xuất kho đồng nghĩa với việc bạn sẽ đồng bộ dữ liệu này sang hệ thống EBS. Bạn chắc chắn muốn xác nhận?",
    "MSG_152": "Xác nhận chuyển kho đồng nghĩa với việc bạn sẽ đồng bộ dữ liệu này sang hệ thống EBS. Bạn có chắc chắn muốn xác nhận không?",
    "MSG_153": "Số phiếu EBS không đúng quy tắc",
    "MSG_154": "Nguồn dữ liệu không hợp lệ",
    "MSG_155": "Số lượng thực nhập nhỏ hơn số lượng kế hoạch. Tiếp tục nhập kho?",
    "MSG_156": "Số lượng thực nhập lớn hơn số lượng kế hoạch. Tiếp tục nhập kho?",
    "MSG_157": "Số lượng kế hoạch lớn hơn số lượng yêu cầu. Bạn có muốn tiếp tục tạo phiếu nhập kho không?",
    "MSG_158": "Số lượng kế hoạch lớn hơn số lượng yêu cầu. Bạn có muốn tiếp tục sửa phiếu nhập kho không?",
    "MSG_159": "Số lô và ngày sản xuất hệ thống sẽ tự sinh. Bạn có muốn tiếp tục nhập kho không?",
    "MSG_160": "Giá trị phải lớn hơn hoặc bằng 0",
    "MSG_161": "Ngày chứng từ phải nhỏ hơn hoặc bằng ngày hiện tại và nhỏ hơn không quá 2 tháng so với ngày hiện tại",
    "MSG_162": "Thông tin sản phẩm đang trùng nhau",
    "MSG_163": "{itemName} sai định dạng",
    "MSG_164": "Ngày sản xuất không được vượt quá ngày hiện tại",
    "MSG_165": "Dữ liệu không đúng định dạng",
    "MSG_166": "Phải có tối thiểu 01 sản phẩm được chọn",
    "MSG_167": "Bạn có chắc chắn muốn cất hàng không?",
    "MSG_168": "Số lượng cất vượt quá số lượng cần cất còn lại",
    "MSG_169": "Cập nhật phiếu nhập kho thành công",
    "MSG_170": "Cần nhập đủ thông tin số lô cho các sản phẩm",
    "MSG_171": "Cần chọn vị trí cất hàng",
    "MSG_172": "Không tìm thấy nguồn dữ liệu từ bảng liên kết",
    "MSG_173": "Bạn có chắc chắn muốn tạo{đối tượng} không?",
    "MSG_174": "Tạo {đối tượng} thành công",
    "MSG_175": "Cần nhập đủ thông tin ngày sản xuất cho các sản phẩm khác",
    "MSG_176": "Bạn có chắc chắn muốn chỉnh sửa {đối tượng} không?",
    "MSG_177": "Cập nhật {đối tượng} thành công",
    "MSG_178": "Trạng thái phiếu nhập kho không hợp lệ",
    "MSG_179": "{item} đã bị xoá",
    "MSG_180": "Bạn có chắc chắn muốn nhập kho & cất hàng không?",
    "MSG_181": "Bạn có chắc chắn muốn nhập kho không?",
    "MSG_182": "Bạn có chắc chắn muốn đóng {đối tượng} không?",
    "MSG_183": "Đóng {đối tượng} thành công",
    "MSG_184": "Bạn có chắc chắn muốn cất hàng không?",
    "MSG_185": "Trạng thái phiếu xuất kho không hợp lệ",
    "MSG_186": "Nhập kho & cất hàng thành công",
    "MSG_187": "Số lượng kế hoạch xuất lớn hơn số lượng yêu cầu. Bạn có muốn tiếp tục xác nhận phiếu xuất kho không?",
    "MSG_188": "Xác nhận {đối tượng} thành công",
    "MSG_189": "Từ chối {đối tượng} thành công",
    "MSG_190": "Tổng số lượng phải nhỏ hơn hoặc bằng {giá trị đối tượng}",
    "MSG_191": "Số lượng kế hoạch xuất lớn hơn số lượng yêu cầu. Bạn có muốn tiếp tục tạo phiếu xuất kho không?",
    "MSG_192": "Số lượng kế hoạch xuất lớn hơn số lượng yêu cầu. Bạn có muốn tiếp tục sửa phiếu xuất kho không?",
    "MSG_193": "Trạng thái{ đối tượng}không hợp lệ.",
    "MSG_194": "{item} không tồn tại trong hệ thống",
    "MSG_195": "{item} đang ở trạng thái tạm dừng",
    "MSG_196": "Giá trị phải lớn hơn 0",
    "MSG_197": "Sản phẩm không thuộc {đối tượng}",
    "MSG_198": "{Đối tượng} không tồn tại",
    "MSG_199": "Số lượng cần cất còn lại bằng 0",
    "MSG_200": "Vị trí không thuộc kho cất",
    "MSG_201": "Số lượng tồn kho bằng 0",
    "MSG_202": "Bạn có chắc chắn muốn lấy hàng và xuất kho không?",
    "MSG_203": "Số lượng thực xuất nhỏ hơn số lượng kế hoạch. Bạn có muốn tiếp tục lấy hàng & xuất kho?",
    "MSG_204": "Lấy hàng & Xuất kho thành công.",
    "MSG_205": "Bạn có chắc chắn muốn lấy hàng không?",
    "MSG_206": "Bạn có chắc chắn muốn xuất kho không?",
    "MSG_207": "Trả phiếu thành công.",
    "MSG_208": "Cần cất vị trí khác vị trí = mã kho",
    "MSG_209": "Phiếu nhập không có số lượng nhập kho chưa cất",
    "MSG_210": "Số lượng thực xuất nhỏ hơn số lượng kế hoạch. Bạn có muốn tiếp tục xuất kho?",
    "MSG_211": "Không tin thấy dữ liệu",
    "MSG_212": "Bạn có chắc muốn hủy {đối tượng} này không?",
    "MSG_213": "Sản phẩm cần cất không hợp lệ",
    "MSG_214": "Bạn không có quyền thao tác {đối tượng}",
    "MSG_215": "Xuất báo cáo thành công",
    "MSG_216": "Thời gian bắt đầu phải nhỏ hơn bằng thời gian kết thúc",
    "MSG_217": "Ngày xuất dự kiến phải lớn hơn hoặc bằng ngày hiện tại",
    "MSG_218": "Số lượng kế hoạch chuyển lớn hơn số lượng yêu cầu. Bạn có muốn tiếp tục tạo lệnh chuyển kho không?",
    "MSG_219": "Số lượng kế hoạch chuyển lớn hơn số lượng yêu cầu. Bạn có muốn tiếp tục sửa lệnh chuyển kho không?",
    "MSG_220": "Kho nhập phải khác kho xuất",
    "MSG_221": "Kho nhập và kho xuất phải cùng tính chất(không lô, có lô)",
    "MSG_222": "Số lượng kế hoạch chuyển lớn hơn số lượng yêu cầu. Bạn có muốn tiếp tục xác nhận lệnh chuyển kho không?",
    "MSG_223": "Trả phiếu thành công.",
    "MSG_224": "Số lượng thực nhập nhỏ hơn số lượng thực xuất. Tiếp tục nhập kho?",
    "MSG_225": "Tạo bản nháp thành công",
    "MSG_226": "Số lượng thực nhập nhỏ hơn hoặc lớn hơn số lượng kế hoạch. Tiếp tục nhập kho?",
    "MSG_227": "Bạn phải cất đủ sản phẩm đã chọn ",
    "MSG_228": "Bạn không có quyền thực hiện chức năng này",
    "MSG_229": "Kho {mã kho} đang thuộc lệnh kiểm kê khác",
    "MSG_230": "Ngày chốt kỳ không vượt quá ba tháng trước hoặc ba tháng tiếp theo",
    "MSG_231": "Ngày chốt kỳ phải trước ngày bắt đầu kiểm kê dự kiến",
    "MSG_232": "Ngày bắt đầu kiểm kê dự kiến không được vượt quá ba tháng so với ngày hiện tại",
    "MSG_233": "Ngày kết thúc kiểm kê dự kiến không được vượt quá ba tháng so với ngày hiện tại",
    "MSG_234": "Ngày bắt đầu phải nhỏ hơn hoặc bằng ngày kết thúc kiểm kê dự kiến",
    "MSG_235": "Ngày bắt đầu kiểm kê dự kiến phải lớn hơn hoặc bằng hiện tại",
    "MSG_236": "Xác nhận lấy hàng thành công",
    "MSG_237": "Vị trí đã thuộc phiếu kiểm kê khác",
    "MSG_238": "Số lượng kế hoạch chuyển lớn hơn số lượng yêu cầu. Bạn có muốn tiếp tục xác nhận phiếu nhập kho không?",
    "MSG_239": "Chưa đến ngày thực hiện kiểm kê",
    "MSG_240": "Bạn có chắc chắn muốn cập nhật kết quả kiểm kê không?",
    "MSG_241": "Ngày sản xuất không đúng định dạng",
    "MSG_242": "Cập nhật kết quả kiểm kê thành công",
    "MSG_243": "{Đối tượng} đã được xác nhận hoàn thành",
    "MSG_244": "Yêu cầu kiểm kê lại thành công",
    "MSG_245": "Cần hoàn thành phiếu kiểm kê đang thực hiện trước khi dừng kiểm kê",
    "MSG_246": "Cần thực hiện kiểm kê trước khi dừng kiểm kê",
    "MSG_247": "Xác nhận dừng kiểm kê thành công",
    "MSG_248": "Thông tin {đối tượng} không hợp lệ",
    "MSG_249": "Phải chọn tối thiểu 1 {đối tượng}",
    "MSG_250": "Đơn vị tính chính và đơn vị tính phụ đang bị trùng",
    "MSG_251": "Đơn vị tính phụ đang bị trùng",
    "MSG_252": "{Đối tượng} đang bị trùng",
    "MSG_253": "Chỉ người tạo có quyền chỉnh sửa bản ghi nháp",
    "MSG_254": "Chỉ người tạo có quyền thực hiện chức năng này",
    "MSG_255": "Gửi yêu cầu phê duyệt {sản phẩm} thành công",
    "MSG_256": "Số lượng nhãn dán quá lớn",
    "MSG_257": "In nhãn dán {đối tượng} thành công",
    "MSG_258": "Kho hiện trường {mã kho đang tạo} cần phải chọn 1 cost center",
    "MSG_259": "Cost center đã được sử dụng ở kho {mã kho bị trùng}",
    "MSG_260": "Sản phẩm có số lượng lấy còn lại =0",
    "MSG_261": "Cần chọn vị trí lấy hàng",
    "MSG_262": "Sức chứa được thiết lập vượt quá thể tích của quy cách đóng gói",
    "MSG_263": "Sức chứa được thiết lập vượt quá trọng tải của quy cách đóng gói",
    "MSG_264": "Quy cách đóng gói {mã quy cách đóng gói} đang được sử dụng, không thể xoá ",
    "MSG_265": "Thiết lập sức chứa cho vị trí {mã vị trí} thành công",
    "MSG_266": "Chưa chọn phiếu, lệnh để {đối tượng}",
    "MSG_267": "Phê duyệt {đối tượng} thành công",
    "MSG_268": "Tài khoản hoặc mật khẩu không chính xác",
    "MSG_269": "Tài khoản của bạn hiện tại đang tạm khóa. Vui lòng liên hệ quản trị viên để được hỗ trợ",
    "MSG_270": "Đăng nhập thành công",
    "MSG_271": "Email không đúng định dạng",
    "MSG_272": "Email không tồn tại",
    "MSG_273": "Mã xác thực không chính xác",
    "MSG_274": "Mật khẩu phải chứa ít nhất 6 ký tự",
    "MSG_275": "Mật khẩu xác nhận phải trùng với mật khẩu mới",
    "MSG_276": "Số điện thoại không đúng định dạng",
    "MSG_277": "Mật khẩu không đúng định dạng",
    "MSG_278": "Số lượng yêu cầu xuất vượt quá số lượng khả dụng",
    "MSG_279": "Kho xuất phải là loại kho logic",
    "MSG_280": "Số lượng cần lấy còn lại bằng 0",
    "MSG_281": "Trạng thái yêu cầu không hợp lệ",
    "MSG_282": "Số lượng kế hoạch lớn hơn số lượng yêu cầu",
    "MSG_283": "Hủy phiếu thành công",
    "MSG_284": "Tài khoản của bạn đã nhập sai mật khẩu {N} lần!",
    "MSG_285": "Tài khoản của bạn đã nhập sai mật khẩu 5 lần, vui lòng thử lại sau 2 giờ!",
    "MSG_286": "Tài khoản của bạn đã nhập sai mật khẩu {N} lần!",
    "MSG_287": "Tài khoản của bạn đã bị khóa, vui lòng liên hệ Admin để mở khóa!",
    "MSG_288": "OTP hết hiệu lực",
    "MSG_289": "Vui lòng nhập mã OTP mới nhất!",
    "MSG_290": "Thiếu thông tin {đối tượng}",
    "MSG_291": "Sản phẩm chỉ được phép thiết lập tối đa 2 đơn vị tính",
    "MSG_292": "Bắt buộc phải chọn 1 đơn vị tính sử dụng tính BOM",
    "MSG_293": "Thể tích sản phẩm vượt quá thể tích của quy cách đóng gói {mã quy cách}",
    "MSG_294": "Trọng lượng sản phẩm vượt quá trọng tải của quy cách đóng gói {mã quy cách}",
    "MSG_295": "Cost center {mã cost center bị trùng} và loại sản phẩm {mã loại sản phẩm bị trùng) bị trùng",
    "MSG_296": "Thể tích sản phẩm vượt quá thể tích của vị trí {mã vị trí}",
    "MSG_297": "Trọng lượng sản phẩm vượt quá trọng tải của vị trí {mã vị trí}",
    "MSG_298": "Không được phép thay đổi đơn vị tính đã đưa vào sử dụng",
    "MSG_299": "Không được phép thay đổi tỷ lệ quy đổi của đơn vị tính phụ đã đưa vào sử dụng",
    "MSG_300": "Số lượng trên kho hiện trường không còn khả dụng để nhập kho",
    "MSG_301": "Mã Kogo phải chứa 10 ký tự",
    "MSG_302": "Số lượng tồn tối đa phải lớn hơn hoặc bằng số lượng tồn tối thiểu",
    "MSG_303": "Chất lượng phải lớn hoặc bằng 0 và nhỏ hơn hoặc bằng 100",
    "MSG_304": "Bắt buộc nhập 1 trong 2 ĐVT với loại sản phẩm là nguyên vật liệu",
    "MSG_305": "Giá trị phải nhỏ hơn hoặc bằng {giá trị đối tượng}",
    "MSG_306": "Sức chứa tại vị trí không đủ",
    "MSG_307": "Số lượng sản phẩm vượt quá sức chứa tại quy cách",
    "MSG_308": "Mã thùng đã tồn tại",
    "MSG_309": "{Đối tượng} không thuộc kho",
    "MSG_310": "Số lượng tồn kho khả dụng bằng 0",
    "MSG_311": "Vị trí đến trùng với vị trí hiện tại",
    "MSG_312": "Chưa chọn{đối tượng}để đảo hàng",
    "MSG_313": "Chưa chọn vị trí đến.",
    "MSG_314": "Các mã thùng của cùng 1 bundle phải trùng nhau",
    "MSG_315": "Phải {Đối tượng} hết đồng thời 2 đơn vị tính",
    "MSG_316": "Các mã thùng giống nhau phải được cất tại 1 vị trí",
    "MSG_317": "Phải lấy hết đồng thời 2 đơn vị tính tại vị trí",
    "MSG_318": "Mã thùng chưa tồn tại trong hệ thống",
    "MSG_319": "Vị trí không thuộc phiếu kiểm kê",
    "MSG_320": "Thùng không thuộc vị trí",
    "MSG_321": "Không tồn tại vị trí nào để thực hiện cất nhanh",
    "MSG_322": "Chọn mã thùng để in mã QRCode",
    "MSG_323": "In nhãn dán QRCode thùng thành công",
    "MSG_324": "Không còn thùng hộp nào chưa đóng gói vào pallet này, vui lòng scan loại thùng hộp khác",
    "MSG_325": "QRCode không hợp lệ",
    "MSG_326": "Thùng sản phẩm không thuộc packing list",
    "MSG_327": "Thông tin sản phẩm - số lượng không phù hợp với thùng hộp cần đóng gói thuộc packing list",
    "MSG_328": "Mã thùng không chứa sản phẩm cần {đối tượng}",
    "MSG_329": "Sản phẩm không khớp với sản phẩm cần đóng vào thùng xuất khẩu",
    "MSG_330": "1 thùng xuất khẩu chỉ được phép chứa hàng của 1 mã đặt hàng",
    "MSG_331": "Không còn sản phẩm cần đóng gói từ thùng hàng này",
    "MSG_332": "Pallet phải chứa tối thiểu 1 thùng hộp",
    "MSG_333": "Các thùng hộp phải được đóng gói đủ số lượng theo quy cách đã gen trong packing list",
    "MSG_334": "Số thùng hộp xuất khẩu vượt quá số lượng cần đóng gói còn lại",
    "MSG_335": "Số lượng sản phẩm/thùng hộp đang vượt quá số lượng cần đóng gói còn lại",
    "MSG_336": "Số lượng sản phẩm hoặc thùng hộp đang vượt quá số lượng cần đóng gói còn lại của mã đặt hàng {Mã đặt hàng}",
    "MSG_337": "Số lượng sản phẩm được lấy từ thùng định danh WMSx vượt quá số lượng đã lấy hàng theo từng mã đặt hàng",
    "MSG_338": "Thực hiện đóng gói thành công",
    "MSG_339": "Thùng hộp không thuộc danh sách cần đóng gói",
    "MSG_340": "Tổng thể tích các thùng hộp đã đóng gói vượt quá thể tích pallet",
    "MSG_341": "Thùng đã thực hiện quét ",
    "MSG_342": "Thời gian áp dụng nhỏ hơn không quá 2 tháng so với ngày hiện tại",
    "MSG_343": "Tỷ lệ phụ phí phải lớn hoặc bằng 0 và nhỏ hơn hoặc bằng 100",
    "MSG_344": "Thời gian áp dụng đang được áp dụng bởi tỷ lệ phụ phí khác",
    "MSG_345": "Năm tài chính nhỏ hơn hoặc bằng 5 năm trước so với hiện tại ",
    "MSG_346": "Năm tài chính lớn hơn hoặc bằng 5 năm tới so với hiện tại ",
    "MSG_347": "Không được mở kỳ kế toán trong tương lại",
    "MSG_348": "Không mở kỳ kế toán nhỏ quá 2 tháng so với hiện tại",
    "MSG_349": "Năm tài chính đã được tạo",
    "MSG_350": "Loại kho không thuộc loại nghiệp vụ",
    "MSG_351": "Chỉ thiết lập phân bổ tồn kho cho yêu cầu nhập kho, yêu cầu xuất kho",
    "MSG_352": "Loại nghiệp vụ đã thiết lập phân bổ tồn kho",
    "MSG_353": "Không tồn tại phiếu nhập kho trên SAP",
    "MSG_354": "Số lượng kế hoạch phải bằng số lượng yêu cầu",
    "MSG_355": "Thiếu thông tin các trường bắt buộc",
    "MSG_356": "Kho đang thực hiện kiểm kê và chặn nhập, xuất",
    "MSG_357": "Phụ phí đã áp dụng vào yêu cầu/phiếu",
    "MSG_358": "{Đối tượng} đã được sử dụng, không thể xoá",
    "MSG_359": "",
    "MSG_360": ""
}